"STORE_DESCRIPTION" = "VLC on avoimen lähdekoodin monipuolinen multimediasoitin.\nToistaa elokuvaa ja musiikkia useimmissa formaateissa ilman muuntamista.\nSallii tiedostojen synkrontia lähiverkossa, sekä Dropbox, GDrive, OneDrive, Box, iCloud Drive ja iTunes. Suoratoisto mediapalvelimilta SMB, FTP, SFTP, NFS, UPnP/DLNA, sekä internetistä.\nVLC tukee tekstitystä, täydellinen SSA yhteensopivuus mukaan lukien, moniraitainen ääni, nopeuden säätö ja Chromecast tuki.\n\nVLC on täysin ilmainen ja avointa lähdekoodia.";

"STORE_DESCRIPTION_TV" = "VLC on avoimen lähdekoodin monipuolinen multimediasoitin.\nToistaa elokuvaa ja musiikkia useimmissa formaateissa ilman muuntamista.\nSallii toiston lähiverkossa MAC ja PC, sekä mediapalvelimista SMB, FTP, SFTP, NFS, UPnP/DLNA, sekä internetistä.\nVLC tukee tekstitystä, täydellinen SSA yhteensopivuus, moniraitainen ääni ja nopeuden säätö.\n\nVLC on täysin ilmainen ja avointa lähdekoodia. Kansikuvat tarjoaa TMDb, joka on yhteisön ylläpitämä elokuvatietokanta.";

"UNKNOWN_TRACK_TYPE" = "Tuntematon raidan tyyppi";
"CHOOSE_TITLE" = "Valitse nimike";
"CHOOSE_CHAPTER" = "Valitse luku";
"CHAPTER_SELECTION_TITLE" = "Kohtaukset";
"TITLE" = "Nimi";
"CHAPTER" = "Kohtaus";
"TRACK_SELECTION" = "Raidan valinta";
"AUDIO" = "Audio";
"SUBTITLES" = "Tekstitykset";
"LANGUAGE" = "Kieli";
"MEDIA_INFO" = "Median tiedot";
"VIDEO_DIMENSIONS" = "Videon mitat";
"FORMAT_VIDEO_DIMENSIONS" = "%ix%i pikseli";
"FORMAT_AUDIO_TRACKS" = "%i audioraitaa";
"ONE_AUDIO_TRACK" = "Audioraita";
"FORMAT_SPU_TRACKS" = "%i tekstitysraitaa";
"ONE_SPU_TRACK" = "Yksi tekstitysraita";
"TRACKS" = "%i kappaletta";
"TRACK" = "%i kappale";
"TRACKS_DURATION" = "%u raitaa, kesto: %@";
"NB_ALBUM_FORMAT" = "%i albumi";
"NB_ALBUMS_FORMAT" = "%i albumia";

"PLAYING_EXTERNALLY_TITLE" = "TV yhdistetty";
"PLAYING_EXTERNALLY_DESC" = "Tätä videota toistetaan TV:ssä";
"PLAYING_EXTERNALLY_ADDITION" = "\nNyt toistetaan:"; /* \n should stay in every translation */

"VFILTER_HUE" = "Sävy";
"VFILTER_CONTRAST" = "Kontrasti";
"VFILTER_BRIGHTNESS" = "Kirkkaus";
"VFILTER_SATURATION" = "Värikylläisyys";
"VFILTER_GAMMA" = "Gamma";

"PRESET_PREAMP_SETTING" = "Esiasetettu / esivahvistimen asetukset";
"PREAMP" = "Esivahvistus";
"SNAP_BANDS" = "Kohdista kanavat";

"PLAYBACK_FAILED" = "Toisto epäonnistui";
"PLEASE_WAIT" = "Odota";
"AR_CHANGED" = "Kuvasuhde: %@";
"DEFAULT" = "Oletus";
"FILL_TO_SCREEN" = "Rajaa täyttämään ruutu";
"PLAYBACK_SPEED" = "Toiston nopeus";
"SPU_DELAY" = "Tekstitysten viive";
"AUDIO_DELAY" = "Audioviive";
"BUTTON_SLEEP_TIMER" = "Uniajastin";
"SLEEP_TIMER_UPDATED" = "Uniajastin päivitetty";
"CONTINUE_PLAYBACK" = "Jatketaanko toistoa?";
"CONTINUE_PLAYBACK_LONG" = "Haluatko jatkaa kohteen \"%@\" toistoa siitä, mihin jäit?";

"BUTTON_ABOUT" = "Tietoja";
"BUTTON_BACK" = "Takaisin";
"BUTTON_DONE" = "Valmis";
"BUTTON_CANCEL" = "Peruuta";
"BUTTON_SAVE" = "Tallenna";
"BUTTON_DOWNLOAD" = "Lataa";
"BUTTON_DELETE" = "Poista";
"BUTTON_OK" = "OK";
"BUTTON_DISMISS" = "Hylkää";
"BUTTON_CONTACT" = "Ota yhteyttä";
"BUTTON_CONNECT" = "Yhdistä";
"BUTTON_RENAME" = "Nimeä uudelleen";
"BUTTON_LEARN_MORE" = "Lisätietoja";
"BUTTON_LOGOUT" = "Kirjaudu ulos";
"BUTTON_CONTINUE" = "Jatka";
"BUTTON_SET" = "Aseta";
"BUTTON_RESET" = "Nollaa";
"BUTTON_RESCAN" = "Skannaa uudelleen";
"PRIVATE_PLAYBACK_TOGGLE" = "Älä tallenna historiaa";
"SCAN_SUBTITLE_TOGGLE" = "Etsi tekstityksiä (vain http-yhteydellä)";

"BUTTON_RENDERER" = "Suoratoistolaitteet";
"BUTTON_RENDERER_HINT" = "Näytä valikko saatavilla olevista suoratoistolaitteista";
"BUTTON_AIRPLAY" = "AirPlay tai Bluetooth";
"BUTTON_AIRPLAY_HINT" = "Näytä valikossa saatavilla olevat AirPlay tai Bluetooth laitteet";

"UPGRADING_LIBRARY" = "Päivitetään mediakirjastoa";

"FAVORITES" = "Suosikit";
"NO_FAVORITES" = "Suosikkeja ei vielä ole";
"NO_FAVORITES_DESCRIPTION" = "Merkitse kansioosi suosikkeja selaamisen aikana ja ne luetellaan tässä.";
"ADD_FAVORITE" = "Lisää suosikkeihin";
"REMOVE_FAVORITE" = "Poista suosikeista";
"FAVORITE_ALERT_TITLE" = "Haluatko lisätä tämän kansion suosikkeihisi?";
"UNFAVORITE_ALERT_TITLE" = "Haluatko poistaa tämän kansion suosikeista?";

"OPEN_NETWORK" = "Avaa suoratoisto verkosta";
"NETWORK_TITLE" = "Verkkosuoratoisto";
"OPEN_NETWORK_HELP" = "Anna mikä tahansa HTTP, RTSP, RTMP, MMS, FTP tai UDP-/RTP osoite ja avaa suoratoisto.";
"HTTP_UPLOAD_SERVER_OFF" = "Palvelin ei ole aktiivinen";
"HTTP_UPLOAD_NO_CONNECTIVITY" = "Ei aktiivista Wifi-yhteyttä";
"OPEN_STREAM_OR_DOWNLOAD" = "Haluaisitko ladata tämän osoitteen tiedoston vai toistaa sen?";
"ALWAYS_STREAM_URL" = "Toista verkko-osoitteet aina";
"SHARED_VLC_IOS_LIBRARY" = "Jaettu VLC for iOS kirjasto";
"SMB_CIFS_FILE_SERVERS" = "Tiedostopalvelimet (SMB)";

"MANAGED_SERVERS" = "Hallittu";

"SMB_CIFS_FILE_SERVERS_SHORT" = "SMB";

"HTTP_DOWNLOAD_CANCELLED" = "Käyttäjä peruutti latauksen";

"DOWNLOAD_FROM_HTTP" = "Lataukset";
"ERROR_NUMBER" = "Virhe %i ilmaantui";
"DOWNLOAD_FAILED" = "Lataus epäonnistui";
"FILE_NOT_SUPPORTED" = "Tiedostomuotoa ei tueta";
"FILE_NOT_SUPPORTED_LONG" = "Tiedostomuotoa %@ ei tueta VLC iOS versiossa.";
"SCHEME_NOT_SUPPORTED" = "Osoitetyyppi ei ole tuettu";
"SCHEME_NOT_SUPPORTED_LONG" = "Osoitetyyppi (%@) ei ole tuettu. Ole hyvä ja käytä HTTP-, HTTPS- tai FTP-alkuista osoitetta.";
"RENAME_MEDIA_TO" = "Syötä uusi nimi tiedostolle %@";

"FOLDER_EMPTY" = "Tyhjä kansio";

"SHARING_ACTION_SHEET_TITLE_CHOOSE_FILE" = "Valitse tiedosto, jonka haluat avata:";
"SHARING_ACTIVITY_OPEN_IN_TITLE" = "Avaa...";
"SHARING_ERROR_NO_FILES" = "Jaettavia tiedostoja ei löytynyt";
"SHARING_ERROR_NO_APPLICATIONS" = "Tälle tiedostotyypille sopivia ohjelmia ei löytynyt";
"SHARING_SUCCESS_CAMERA_ROLL" = "Tiedosto tallennettiin Kameran rullaan";

"FAVORITEVC_DETAILTEXT" = "Katso suosikit kansiota";
"STREAMVC_DETAILTEXT" = "Toista suoratoistona ilman lataamista";
"DOWNLOADVC_DETAILTEXT" = "Lataa tiedostot suoraan laitteellesi";
"HEADER_TITLE_RENDERER" = "Valitse suoratoiston laite";

"BROWSE" = "Selaa";
"NETWORK" = "Verkko";
"LOCAL_NETWORK" = "Lähiverkko";
"CONNECT_TO_SERVER" = "Yhdistä palvelimeen";
"FILE_SERVER" = "Tiedostopalvelimet";
"USER_LABEL" = "Käyttäjä";
"PASSWORD_LABEL" = "Salasana";
"DISABLE_LABEL" = "Poista käytöstä";
"BUTTON_ANONYMOUS_LOGIN" = "Nimetön kirjautuminen";

"LOCAL_SERVER_REFRESH" = "Päivitä";
"LOCAL_SERVER_LAST_UPDATE" = "Viimeksi päivitetty %@";
"LOCAL_SERVER_CONNECTION_FAILED_TITLE" = "PALVELIMEEN YHDISTÄMINEN EPÄONNISTUI";
"LOCAL_SERVER_CONNECTION_FAILED_MESSAGE" = "Tarkista palvelimen osoite ja kirjautumistiedot";

"FILES_APP_CELL_TITLE" = "Paikalliset tiedostot";
"FILES_APP_CELL_SUBTITLE" = "Avaa tiedosto kopioimatta sitä VLC:hen";

"CLOUD_SERVICES" = "Pilvipalvelut";
"LOGIN" = "Kirjaudu";
"LOGGED_IN" = "Kirjautunut";
"LOGGED_IN_SERVICES" = "%d kirjautuneena palveluun";
"LOGGED_IN_SERVICE" = "1 kirjautuneena palveluun";

"DROPBOX_DOWNLOAD" = "Ladataanko tiedosto?";
"DROPBOX_DL_LONG" = "Haluatko ladata tiedoston \"%@\" laitteelle %@?";
"DROPBOX_LOGIN" = "Kirjaudu";

"GDRIVE_ERROR_FETCHING_FILES" = "Virhe haettaessa tiedostoja";
"GDRIVE_DOWNLOAD_SUCCESSFUL" = "Tiedoston lataus onnistui";
"GDRIVE_DOWNLOAD_SUCCESSFUL_TITLE" = "VALMIS";
"GDRIVE_ERROR_DOWNLOADING_FILE" = "Ladattaessa ilmaantui virhe";
"GDRIVE_ERROR_DOWNLOADING_FILE_TITLE" = "VIRHE";

"ONEDRIVE_MEDIA_WITHOUT_URL" = "Valitulla medialla ei ole toimivaa verkko-osoitetta";

"DISK_FULL" = "Tallennustilaa ei ole jäljellä";
"DISK_FULL_FORMAT" = "Tiedostoa %@ ei voida tallentaa laitteeseen %@, koska siinä ei ole riittävästi vapaata tilaa.";

"NUM_OF_FILES" = "%i tiedostoa";
"ONE_FILE" = "1 tiedosto";
"NO_FILES" = "Ei tuettuja tiedostoja";
"DOWNLOADING" = "Ladataan...";
"REMAINING_TIME" = "Aikaa jäljellä: %@";
"BIOMETRIC_UNLOCK" = "Avaa mediakirjaston lukitus\nPeruuta pääsykoodilla";

// Passcode Strings that we need to localize for them
"Set Passcode" = "Aseta pääsykoodi";
"Enter Passcode" = "Anna pääsykoodi";
"Enter a passcode" = "Anna pääsykoodi";
"Enter your passcode" = "Anna pääsykoodi";
"Passcodes did not match. Try again." = "Pääsykoodit ei täsmää. Yritä uudelleen.";
"Re-enter your passcode" = "Anna pääsykoodi uudelleen";
"Passcode Options" = "Pääsykoodin asetukset";
"4-Digit Numeric Code" = "4-numeroinen koodi"; /* Passcode 4 digit numeric code */
"6-Digit Numeric Code" = "6-numeroinen koodi"; /* Passcode 6 digit numeric code */

"Settings" = "Asetukset"; // plain text key to keep compatibility with InAppSettingsKit's upstream
"ON" = "Päällä";
"OFF" = "Pois";

"EMPTY_LIBRARY" = "Mediakirjasto on tyhjä";
"EMPTY_LIBRARY_LONG" = "Voit suoratoistaa mediaa lähiverkon palvelimelta, pilvestä tai synkronoida mediatiedostoja laitteeseen iTunes, Wi-Fi Upload tai Cloud palveluiden avulla.";

"EMPTY_NO_PLAYLISTS" = "Soittolistat";
"EMPTY_NO_PLAYLISTS_DESCRIPTION" = "Jos haluat luoda soittolistoja, siirry video tai audio välilehteen ja valitse suosikkisi.\nVoit myös synkronoida valmiit soittolistat muista laitteistasi tai internetistä.";

"EMPTY_PLAYLIST" = "Tyhjä soittolista";
"EMPTY_PLAYLIST_DESCRIPTION" = "Lisää media muokkaamalla vastaavia luokia.";

"EMPTY_HISTORY" = "Tyhjennä historia";
"EMPTY_HISTORY_DESCRIPTION" = "Ei ole vielä mediaa.";

"EMPTY_MEDIA_LIST" = "Tyhjä medialista";
"EMPTY_MEDIA_LIST_DESCRIPTION" = "Medialista on tyhjä, joten toistoa ei voitu aloittaa";

"PLAYBACK_SCRUB_HELP" = "Liu'uta sormeasi ylöspäin säätääksesi raahausnopeutta.";
"PLAYBACK_SCRUB_HIGH" = "Nopea raahaus";
"PLAYBACK_SCRUB_HALF" = "Puolinopea raahaus";
"PLAYBACK_SCRUB_QUARTER" = "Raahaus neljäsosanopeudella";
"PLAYBACK_SCRUB_FINE" = "Tarkka raahaus";
"PLAYBACK_SCRUB_TOTAL_TIME_FORMAT" = "%@ kulunut kesto %@"; /* 1: elapsed time, 2: total time */
"PLAYBACK_SCRUB_REMAINING_TIME_FORMAT" = "%@ kulunut, %@"; /* 1: elapsed time, 2: remaining time */
"PLAYBACK_SCRUB_ACCESSIBILITY_TIME_DISPLAY" = "Ajan näyttö";
"PLAYBACK_POSITION" = "Toistosijainti";
"VIDEO_FILTER" = "Videosuodattimet";
"VIDEO_FILTER_RESET_BUTTON" = "Nollaa videosuodattimet";
"VIDEO_ASPECT_RATIO_BUTTON" = "Videon kuvasuhde";
"BWD_BUTTON" = "Hyppää taaksepäin";
"FWD_BUTTON" = "Hyppää eteenpäin";
"PLAY_BUTTON" = "Toista";
"NEXT_BUTTON" = "Seuraava";
"PREV_BUTTON" = "Edellinen";
"PLAY_ALL_BUTTON" = "Toista kaikki";
"PLAY_ALL_HINT" = "Toista kaikki mediat kokoelmassa";

"RESET_VIDEO_FILTERS" = "Haluatko nollata videon suodattimet?";
"RESET_PLAYBACK_SPEED" = "Haluatko nollata toiston nopeuden?";
"RESET_EQUALIZER" = "Haluatko nollata taajuuskorjaimen asetukset?";
"RESET_SLEEP_TIMER" = "Haluatko nollata uniajastimen?";

"CUSTOM_EQUALIZER_PROFILES" = "Mukautetut profiilit";
"DEFAULT_PROFILE_NAME" = "Mukautettu profiili";
"CUSTOM_EQUALIZER_ALERT_TITLE" = "Tallenna uusi profiili";
"CUSTOM_EQUALIZER_ALERT_MESSAGE" = "Haluatko tallentaa uuden profiilin valituilla arvoilla?";
"RENAME_CUSTOM_PROFILE_TITLE" = "Nimeä profiili uudelleen";
"DELETE_CUSTOM_PROFILE_TITLE" = "Poista profiili";
"DELETE_CUSTOM_PROFILE_MESSAGE" = "Haluatko poistaa tämän profiilin?";

"VERSION_FORMAT" = "Versio: %@";
"BASED_ON_FORMAT" = "Pohjautuu:<br />%@";

"NEW" = "UUSI";

"VO_VIDEOPLAYER_TITLE" = "Videosoitin";
"VO_VIDEOPLAYER_DOUBLETAP" = "Näytä tai piilota toistotyökalut napauttamalla kahdesti";

"FIRST_STEPS_ITUNES" = "Tiedostojen synkronointi";
"FIRST_STEPS_ITUNES_TITLE" = "Synkronoi tietokoneen kanssa";
"FIRST_STEPS_ITUNES_DETAILS" = "Yhdistä ja käytä %@ Finder tai iTunes \"tiedostonjakoon\". Valitse VLC ja siirrä tiedostoja.";
"FIRST_STEPS_WIFI_TITLE" = "Jaa Wifi-yhteydellä";
"FIRST_STEPS_WIFI_DETAILS" = "Anna selaimella luotu osoite, kun olet yhteydessä puhelimen kanssa samaan verkkoon %@.";
"FIRST_STEPS_CLOUDS" = "Pilvipalvelut";
"FIRST_STEPS_CLOUD_TITLE" = "Pilvipalvelu";
"FIRST_STEPS_CLOUD_DETAILS" = "Lataa mediasi pilvipalveluun, kuten Google Drive tai Dropbox, jotta voit toistaa tai ladata mediaa etänä.";

"PLEX_CHECK_ACCOUNT" = "Tarkista Plex-tilisi asetuksissa";
"PLEX_ERROR_ACCOUNT" = "Plex-kirjautumisvirhe";

"UNAUTHORIZED" = "Ei pääsyä";

"SERVER" = "Palvelin";
"SERVER_PORT" = "Portti";
"NO_SERVER_FOUND" = "Palvelinta ei löytynyt";
"NO_RECENT_STREAMS" = "Ei äskettäisiä suoratoistoja";

"WEBINTF_TITLE" = "Jaa Wifi-yhteydellä";
"WEBINTF_ETHERNET" = "Jakaminen lähiverkossa";
"WEBINTF_DROPFILES" = "Pudota tiedostoja";
"WEBINTF_DROPFILES_LONG" = "Lisää tiedostoja laitteeseen %@ vetämällä ja pudottamalla ne tähän ikkunaan. <br>Voit myös napsauttaa \"+\"-painiketta tiedostojen lisäämiseksi.";
"WEBINTF_DOWNLOADFILES" = "Lataa tiedostoja";
"WEBINTF_DOWNLOADFILES_LONG" = "Napsauta tiedostoa, jonka haluat ladata laitteelta %@.";
"WEBINTF_ADDRESS_COPIED" = "Osoite kopioitu leikepöydälle";
"WEBINTF_TITLE_ATV" = "Etätoisto";
"WEBINTF_DROPFILES_LONG_ATV" = "Pudota tiedostoja ikkunaan, jotta voit toistaa niitä laitteella %@.<br>Voit myös napsauttaa painiketta \"+\" valitaksesi tiedostot ikkunan avulla.";
"WEBINTF_URL_SENT" = "Osoite lähetetty onnistuneesti.";
"WEBINTF_URL_EMPTY" = "Osoite ei voi olla tyhjä.";
"WEBINTF_URL_INVALID" = "Osoite ei kelpaa.";
"WEBINTF_AUTH_REQUIRED" = "Anna määrittämäsi VLC iOS pääsykoodi:";
"WEBINTF_AUTH_WRONG_PASSCODE" = "Väärä pääsykoodi. <br>yritystä jäljellä:";
"WEBINTF_AUTH_BANNED" = "Annoit pääsykoodin väärin useasti. <br>Käynnistä VLC iOS ja yritä uudelleen.";

"DURATION" = "Kesto";
"TITLE" = "Nimi";
"ROTATE_BUTTON" = "Kierrä"; /* Accessibility label for rotate button on the player */
"ROTATE_BUTTON_HINT" = "Vaihtaa videosoittimen vaaka- ja pystytilan välillä."; /* Accessibility hint for rotate button on the player */

"AUDIO_INFO_VC_TITLE" = "Audio tiedot";
"ENTER_URL" = "Syötä toistettava osoite";
"HTTP_SERVER_ON" = "Poista etätoisto käytöstä";
"HTTP_SERVER_OFF" = "Ota etätoisto käyttöön";
"CACHED_MEDIA" = "Media välimuistissa";
"CACHED_MEDIA_LONG" = "Tässä näytetään mediat, jotka on tallennettu Apple TV:n muistiin. Huomaa, että käyttöjärjestelmä voi poistaa medioita ennakkoon ilmoittamatta silloin kun VLC ei ole käytössä, jos laitteen tila loppuu kesken.";
"DOWNLOAD_SUBS_FROM_OSO" = "Lataa tekstityksiä...";
"FOUND_SUBS" = "Tekstityksiä löytyi";
"NO_SUB_FOUND_OSO" = "Medialle \"%@\" ei löytynyt tekstitystä.";
"SELECT_AUDIO_FROM_FILES" = "Lataa audiotiedosto...";
"SELECT_SUBTITLE_FROM_FILES" = "Lataa ulkoinen tekstitys...";
"USE_SPDIF" = "Käytä läpivientiä (S/PDIF)";

"PLAYBACK" = "Toisto";
"REPEAT_MODE" = "Toistuvasti";
"REPEAT_DISABLED" = "Pois käytöstä";
"REPEAT_SINGLE" = "Yksittäinen";
"REPEAT_FOLDER" = "Kansio";
"SHUFFLE" = "Sekoita";
"SHUFFLE_DISABLED" = "Satunnaistoisto pois";

"RESET_NETWORK_STREAM_LIST_TITLE" = "Nollaa lista";
"RESET_NETWORK_STREAM_LIST_TEXT" = "Nollaa äskettäin verkosta toistetut luettelo pysyvästi.";

// MARK: - Local Network Service Names
"UPNP_LONG" = "Universal Plug'n'Play (UPnP)";
"UPNP_SHORT" = "UPnP";

"PLEX_LONG" = "Plex-mediapalvelin (Bonjourin kautta)";
"PLEX_SHORT" = "Plex";

"FTP_SHORT" = "FTP";
"SFTP_SHORT" = "SFTP";

"NFS_LONG" = "Verkon tiedostojärjestelmä (NFS)";
"NFS_SHORT" = "NFS";

"BONJOUR_FILE_SERVERS" = "BONJOUR tiedostopalvelin";
"DSM_WORKGROUP" = "Työryhmä";

"URL_NOT_SUPPORTED" = "Verkko-osoitetta ei voi avata";

// Insert %@ where play-pause-glyph should be placed
"DELETE_ITEM_HINT" = "Poista painamalla %@"; /* Insert %@ where play-pause-glyph should be placed */
"DELETE_MESSAGE" = "Vahvista valittujen poisto";
"DELETE_MESSAGE_PLAYLIST" = "Haluatko varmasti poistaa valitun soittolistan?\nLiitettyjä median tiedostoja ei poisteta.";
"DELETE_MESSAGE_PLAYLIST_CONTENT" = "Haluatko varmasti poistaa valitun median soittolistalta?\nNiitä ei poisteta levyltä.";

// MARK: - Drag and Drop

"PROTOCOL_NOT_SELECTED" = "Protokollaa ei ole valittu";
"Settings" = "Asetukset";

"ERROR" = "Virhe";
"SORT" = "Järjestä";
"SORT_BY" = "Järjestä";
"SEARCH" = "Haku";
"VIDEO" = "Video";

// MARK: - MediaViewController Swipable Header
"ALBUMS" = "Albumit";
"ARTISTS" = "Artistit";
"EPISODES" = "Jaksot";
"GENRES" = "Tyylilajit";
"ALL_VIDEOS" = "Kaikki videot";
"SONGS" = "Kappaleet";
"PLAYLISTS" = "Soittolistat";
"VIDEO_GROUPS" = "Videoryhmät";
"HISTORY" = "Historia";
"MODIFIED_DATE" = "Muokkauspäivä";
"NAME" = "Nimi";

// MARK: - EDIT

"BUTTON_MENU" = "Valikko";
"BUTTON_MENU_HINT" = "Valitse, järjestä ja lajittele näkymässä olevat mediat";

"BUTTON_EDIT" = "Muokkaa";
"BUTTON_EDIT_HINT" = "Muokkaustila";

"BUTTON_SELECT" = "Valitse";
"BUTTON_SELECT_HINT" = "Valintapainike";

"BUTTON_SELECT_ALL" = "Valitse kaikki";
"BUTTON_SELECT_ALL_HINT" = "Valitse kaikki tässä näkymässä olevat mediat";

"BUTTON_HISTORY" = "Historia";
"BUTTON_HISTORY_HINT" = "Tarkastele äskettäin toistettua mediaa";

"BUTTON_CLEAR" = "Tyhjennä";
"CLEAR_HISTORY_TITLE" = "Tyhjennä historia";
"CLEAR_HISTORY_MESSAGE" = "Vahvista historian tyhjennys";

"ADD_TO_PLAYLIST" = "Lisää soittolistaan";
"ADD_TO_PLAYLIST_HINT" = "Avaa valikko \"Lisää soittolistaan\"";

"PLAY_AS_AUDIO" = "Toista vain audio";
"PLAY_AS_AUDIO_HINT" = "Toista vain videon audio.";

"PLAYLIST_PLACEHOLDER" = "Soittolistan otsikko";
"PLAYLIST_DESCRIPTION" = "Valitse otsikko uudelle soittolistallesi";
"PLAYLIST_CREATION" = "Luo uusi soittolista";
"PLAYLIST_CREATION_HINT" = "Näytä vuorovaikutteinen toiminto soittolistan luomiseksi";
"ERROR_PLAYLIST_CREATION" = "Soittolistan luominen epäonnistui";
"ERROR_PLAYLIST_TRACKS" = "Kappaleiden noutaminen epäonnistui";

"ERROR_RENAME_FAILED" = "Nimeäminen uudelleen epäonnistui";
"ERROR_EMPTY_NAME" = "Nimi ei voi olla tyhjä";

"SHARE_LABEL" = "Jaa";
"SHARE_HINT" = "Jaa valitut tiedostot";
"RENAME_HINT" = "Nimeä valitut tiedostot uudelleen";
"DELETE_HINT" = "Poista valitut tiedostot";

"ADDITIONAL_OPTIONS" = "Lisäasetukset";

// MARK: - Sort

"BUTTON_SORT" = "Järjestä";
"BUTTON_SORT_HINT" = "Näytä järjestystoiminto";
"HEADER_TITLE_SORT" = "Järjestä";
"DESCENDING_LABEL" = "Laskeva järjestys";
"DESCENDING_SWITCH_LABEL" = "Nouseva tai laskeva järjestys";
"DESCENDING_SWITCH_HINT" = "Lajittele sisältö nousevaan tai laskevaan järjestykseen";
"GRID_LAYOUT" = "Ruudukko";
"GRID_LAYOUT_HINT" = "Näytä ruudukkona";
"LIST_LAYOUT" = "Lista";
"HIDE_FEAT_ARTISTS" = "Piilota artistit";
"HIDE_TRACK_NUMBERS" = "Piilota raidan numero";

// MARK: - VLCMediaLibraryKit - Sorting Criteria

"ALPHA" = "Aakkosittain";
"DURATION" = "Kesto";
"INSERTION_DATE" = "Lisätty";
"LAST_MODIFICATION_DATE" = "Viimeisin muokkauspäivä";
"RELEASE_DATE" = "Julkaisupäivä";
"FILE_SIZE" = "Tiedostokoko";
"ARTIST" = "Artisti";
"PLAY_COUNT" = "Soittomäärä";
"ALBUM" = "Albumi";
"FILENAME" = "Tiedostonimi";
"TRACK_NUMBER" = "Raidan numero";
"NB_AUDIO" = "Audio nro";
"NB_MEDIA" = "Media nro";
"NB_VIDEO" = "Video nro";
"NB_ALBUM" = "Albumien määrä";
"LAST_PLAYBACK_DATE" = "Viimeinen toistopäivä";
"TRACK_ID" = "Raidan tunniste";
"CUSTOM" = "Mukauta";

// MARK: - VLCNetworkLoginTVViewController

"NO_SAVING_DATA" = "Mitään ei löytynyt";

// MARK: - MediaCollectionViewCell

"UNKNOWN_ARTIST" = "Tuntematon artisti";
"VARIOUS_ARTIST" = "Useat artistit";
"UNKNOWN_ALBUM" = "Tuntematon albumi";
"SINGLE_ITEM_SELECTED" = "kohde valittu";
"MULTIPLE_ITEMS_SELECTED" = "kohdetta valittu";

// MARK: - VideoPlayerControls

"SUBTITLE_AND_TRACK_BUTTON" = "Tekstitys ja audioraidat";
"SUBTITLE_AND_TRACK_HINT" = "Valitse tekstitys tai audioraita";

"DVD_BUTTON" = "DVD";
"DVD_HINT" = "DVD käyttöliittymä";

"ROTATION_LOCK_BUTTON" = "Kiertolukko";
"ROTATION_LOCK_HINT" = "Lukitse video nykyiseen asentoon";

"REPEAT_HINT" = "Toistuvasti samaa mediaa";
"DO_NOT_REPEAT_HINT" = "Älä toista medialistaa toistuvasti";
"REPEAT_ALL_HINT" = "Toista medialistaa toistuvasti";

"BACKWARD_BUTTON" = "Taaksepäin";
"BACKWARD_HINT" = "Hyppää taaksepäin";

"PREVIOUS_BUTTON" = "Edellinen";
"PREVIOUS_HINT" = "Edellinen media";

"PLAY_PAUSE_BUTTON" = "Toista tai keskeytä";
"PLAY_PAUSE_HINT" = "Toista tai keskeytä toisto";

"STOP_BUTTON" = "Pysäytä";
"CLOSE_HINT" = "Pysäytä toisto";

"MINIMIZE_BUTTON" = "Minimoi";
"MINIMIZE_HINT" = "Pienennä soitin";

"NEXT_HINT" = "Seuraava media";

"FORWARD_BUTTON" = "Eteenpäin";
"FORWARD_HINT" = "Hyppää eteenpäin";

"INTERFACE_LOCK_BUTTON" = "Lukittu käyttöliittymä";

"SELECT_A_MARK" = "Valitse A-merkki";
"SELECT_A_MARK_HINT" = "Valitse AB-silmukan A-merkki";
"SELECT_B_MARK" = "Valitse B-merkki";
"SELECT_B_MARK_HINT" = "Valitse AB-silmukan B-merkki";

"AB_LOOP" = "A→B silmukka";
"AB_LOOP_MARKS" = "A→B silmukan merkit";

"RESET_AB_LOOP" = "Haluatko poistaa A→B silmukan?";
"RESET_AB_LOOP_MARKS" = "Haluatko nollata A→B silmukan merkit?";

"SHUFFLE_HINT" = "Sekoita lista";
"SHUFFLE_OFF_HINT" = "Älä sekoita medialistaa";

"ASPECT_RATIO_TITLE" = "Kuvasuhde";
"VIDEO_ASPECT_RATIO_BUTTON" = "Videon kuvasuhde";
"VIDEO_ASPECT_RATIO_HINT" = "Muuta videon kuvasuhdetta";

"MORE_OPTIONS_BUTTON" = "Lisää";
"MORE_OPTIONS_HINT" = "Näytä lisää säätimiä";

"PLAYBACK_CONTROLS_BAR_TITLE" = "Toiston säätimet";
"PLAYBACK_CONTROLS_BAR_HINT" = "Tauko, kelaa, seuraava";

"PLAYER_WARNING_SUBTITLE_CAST_TITLE" = "Tekstityksiä ei tueta";
"PLAYER_WARNING_SUBTITLE_CAST_DESCRIPTION" = "Tekstityksiä ei vielä tueta suoratoiston aikana.";

// MARK: - MediaMoreOptionsActionSheet
"EQUALIZER_CELL_TITLE" = "Taajuuskorjain";
"MORE_OPTIONS_HEADER_TITLE" = "Video asetukset";
"MORE_OPTIONS_HEADER_AUDIO_TITLE" = "Audio asetukset";
"BOOKMARKS_TITLE" = "Kirjanmerkit";
"ADD_BOOKMARKS_TITLE" = "Lisää kirjanmerkki";
"BOOKMARK_DEFAULT_NAME" = "Kirjanmerkki kohdassa";
"BOOKMARK_RENAME_TITLE" = "Nimeä kirjanmerkki";
"BOOKMARK_DELETE_TITLE" = "Poista kirjanmerkki";
"BOOKMARK_DELETE_MESSAGE" = "Vahvista kirjanmerkin poistaminen";
"INCREASE_BUTTON" = "Lisää painike";
"INCREASE_PLAYBACK_SPEED" = "Lisää toistonopeutta";
"INCREASE_AUDIO_DELAY" = "Lisää äänen viivettä";
"INCREASE_SUBTITLES_DELAY" = "Lisää tekstityksen viivettä";
"DECREASE_BUTTON" = "Vähennä painike";
"DECREASE_PLAYBACK_SPEED" = "Vähennä toistonopeutta";
"DECREASE_AUDIO_DELAY" = "Vähennä äänen viivettä";
"DECREASE_SUBTITLES_DELAY" = "Vähennä tekstityksen viivettä";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT" = "Näytä toistonopeuden kuvake";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT_HINT" = "Ota käyttöön toistonopeuden kuvake";
"VIDEO_FILTERS_HINT" = "Valitse ja avaa videosuodattimet";
"PLAYBACK_SPEED_HINT" = "Valitse ja avaa toistonopeus";
"SUBTITLES_DELAY_HINT" = "Valitse ja avaa tekstitysviive";
"AUDIO_DELAY_HINT" = "Valitse ja avaa audio viivenäkymän";
"SLEEP_TIMER_HINT" = "Valitse ja avaa uniajastin";
"EQUALIZER_HINT" = "Valitse ja avaa taajuuskorjain";
"CHAPTERS_HINT" = "Valitse ja avaa lukunäkymä";
"BOOKMARKS_HINT" = "Valitse ja avaa kirjanmerkit";
"INTERFACE_LOCK_HINT" = "Ota käyttöön lukitsemisen valinnat käyttöliittymässä";

// MARK: - Settings
"FORCE_RESCAN_TITLE" = "Pakota mediakirjaston tarkistus uudelleen";
"FORCE_RESCAN_MESSAGE" = "Haluatko pakottaa VLC:n tarkistamaan mediakirjastosi uudelleen?\nSe voi viedä aikaa.";

"FEEDBACK_EMAIL_TITLE" = "Palautetta VLC iOS ja iPad laitteilla";
"FEEDBACK_EMAIL_NOT_POSSIBLE_TITLE" = "Sähköpostitiliä ei ole määritetty";
"FEEDBACK_EMAIL_NOT_POSSIBLE_LONG" = "Ota meihin yhteyttä %@ toisesta laitteesta.";

"SETTINGS_THEME_BLACK" = "Käytä mustaa taustaa tummassa tilassa";
"SETTINGS_THEME_BLACK_SUBTITLE" = "Parantaa akun käyttöaikaa laitteissa, joissa on OLED-näyttö";

"SETTINGS_RESET_TITLE" = "Palauta asetukset";
"SETTINGS_RESET_MESSAGE" = "Haluatko palauttaa kaikki asetukset oletuksiin?";

"SETTINGS_PLAY_ALL" = "Kokoelmien saumaton toisto";
"SETTINGS_PLAY_ALL_HINT" = "Ota käyttöön seuraavan median toistaminen autom. audio- tai videovälilehdeltä";
"SETTINGS_PLAYLIST_PLAY_ALL" = "Soittolistojen saumaton toisto";
"SETTINGS_PLAYLIST_PLAY_ALL_HINT" = "Ota käyttöön soittolistan automaattinen seuraavan toisto";

"SETTINGS_DOCUMENTATION" = "Ohjeet";

// MARK: - Local Network

"SMBV1_WARN_TITLE" = "SMBv1 yhteysvaroitus";
"SMBV1_WARN_DESCRIPTION" = "Havaitsimme vanhentuneen protokollan (SMBv1).\nHaluatko varmasti jatkaa SMBv1:n käyttöä?\nSuosittelemme päivittämään tai muuttamaan palvelimen asetuksia.";
"SMBV1_CONTINUE" = "Jatka SMBv1";
"SMBV1_NEXT_PROTOCOL" = "Kokeile SMBv2/v3";

// MARK: - Preview labels

"ENCODING" = "Purkukoodaus";

// MARK: - Media groups

"ADD_TO_MEDIA_GROUP" = "Lisää mediaryhmään";
"ADD_TO_MEDIA_GROUP_HINT" = "Avaa valikko \"Lisää mediaryhmään\"";

"MEDIA_GROUPS" = "Mediaryhmät";
"MEDIA_GROUPS_DESCRIPTION" = "Valitse otsikko uudelle mediaryhmälle";
"MEDIA_GROUPS_PLACEHOLDER" = "Mediaryhmän otsikko";

"REMOVE_FROM_MEDIA_GROUP" = "Poista mediaryhmä";
"REMOVE_FROM_MEDIA_GROUP_HINT" = "Poista valinta mediaryhmästä";

"MEDIA_GROUP_CREATION" = "Uusi mediaryhmä";
"MEDIA_GROUP_CREATION_HINT" = "Näytä hälytys soittolistaa tehdessä";
"MEDIA_GROUP_MOVE_TO_ROOT" = "Siirrä sisältö ylimmälle tasolle";
"MEDIA_GROUP_MOVE_TO_ROOT_HINT" = "Siirtää sisällön valinnan ylimmälle tasolle";

"BUTTON_REGROUP" = "Ryhmittele";
"BUTTON_REGROUP_TITLE" = "Valinnan uudelleen ryhmittely";
"BUTTON_REGROUP_HINT" = "Yritä ryhmitellä automaattisesti media uudelleen.";
"BUTTON_REGROUP_DESCRIPTION" = "Haluatko varmasti ryhmitellä uudelleen yksittäisen median automaattisesti?\nTämä voi viedä aikaa.";

// MARK: - Files.app persistence file
"MEDIALIBRARY_FILES_PLACEHOLDER" = "Lisää media tähän";
"MEDIALIBRARY_ADDING_PLACEHOLDER" = "Lisätään...";

// MARK: - QueueViewController

"PLAY_HINT" = "Toista";
"PLAY_LABEL" = "Toista";
"PLAY_NEXT_IN_QUEUE_HINT" = "Toista seuraava jonosta";
"PLAY_NEXT_IN_QUEUE_LABEL" = "Toista seuraava jonosta";
"APPEND_TO_QUEUE_HINT" = "Liitä jonoon";
"APPEND_TO_QUEUE_LABEL" = "Liitä jonoon";
"QUEUE_LABEL" = "Jono";

"DISPLAY_AS" = "Näytä muodossa";

/* New strings */
"BRIGHTNESS_HINT" = "Pystysuora kirkkauden säätö";
"BRIGHTNESS_SLIDER" = "Muuta kirkkautta pyyhimällä pystysuuntaan";

/* New strings */
"VOLUME_HINT" = "Pystysuora voimakkuuden säätö";
"VOLUME_SLIDER" = "Muuta voimakkuutta pyyhimällä pystysuuntaan";

// MARK: - AudioMiniPlayer playback controls menu
"MENU_PLAYBACK_CONTROLS" = "Toiston säätimet";
"MENU_REPEAT_DISABLED" = "Ei toistoa uudelleen";
"MENU_REPEAT_SINGLE" = "Uudestaan kerran";
"MENU_REPEAT_ALL" = "Uudestaan kaikki";

// MARK: - ActionSheet

"ACTIONSHEET_BACKGROUND_LABEL" = "Arkin tausta";
"ACTIONSHEET_BACKGROUND_HINT" = "Poista näkymä napauttamalla.";

// MARK: - Donation
"DONATION_CUSTOM_AMOUNT" = "Anna valitsemasi summa";
"DONATION_TITLE" = "Yksityisyys voiton edelle";
"DONATION_DESCRIPTION" = "Sinun rahoittama, avoimen lähdekoodin multimedia. Ei mainoksia, ei seurantaa, ei kompromisseja. Ilmainen kaikkien käyttöön. Lahjoita nyt ja tue VideoLANia.";
"DONATION_WINDOW_TITLE" = "Tee lahjoitus VideoLAN:lle";
"DONATE_CC_DC" = "Luotto- tai pankkikortti";
"DONATION_CHOOSE_PP" = "Valitse sinun maksupalvelun tarjoaja";
"DONATION_CHOOSE_CURRENCY" = "Valitse valuutta";
"DONATION_AMOUNT" = "Lahjoituksen määrä: %@";
"DONATION_CC_NUM" = "Luottokortin numero";
"DONATION_CC_EXPIRY_DATE" = "Voimassaolo";
"DONATION_CC_EXPIRY_DATE_MONTH" = "MM";
"DONATION_CC_EXPIRY_DATE_YEAR" = "YY";
"DONATION_CC_CVV" = "CVV";
"DONATION_APPLE_PAY_NOT_POSSIBLE" = "Apple Pay määritys epäonnistui";
"DONATION_APPLE_PAY_NOT_POSSIBLE_LONG" = "VLC ei voinut määrittää Apple Pay toimintoa suorittamaan lahjoitustasi. Jatka valitsemalla joku toinen maksupalveluntarjoaja.";
"DONATION_DONATE_BUTTON" = "Lahjoita";
"PURCHASE_FAILED" = "Osto epäonnistui.";
"SEND_DONATION" = "Lähetä lahjoitus";
"PURCHASE_SUCESS_TITLE" = "Lahjoitus lähetetty";
"PURCHASE_SUCESS_DESCRIPTION" = "Kiitos lahjoituksesta!";
"DONATION_CONTINUE" = "Jatka";
"BUTTON_NOT_NOW" = "Ei vielä";
"DONATION_NAGSCREEN_TITLE" = "Lahjoita tänään";
"DONATION_NAGSCREEN_SUBTITLE" = "Avusta vapaata ja avoimen lähdekoodin multimediaa";
"DONATION_INVOICES" = "Laskut";
"DONATION_RECEIPTS" = "Kuitit";
"DONATION_INVOICES_RECEIPTS" = "Laskut ja kuitit";
"DONATION_CHARGES_CLEARED_ON_REINSTALL" = "Jos asensit VLC:n uudelleen, aiempien lahjoitusten laskut tai kuitit eivät ole saatavilla, koska kaikki henkilökohtaiset tietosi tallennetaan vain sinun laitteelle.\n\nJos sinulla on kysyttävää, ota meihin yhteyttä donation@videolan.org ja mainitse sinun anonyymi käyttäjätunnus: %@";
"DONATION_CANCEL_MONTHLY" = "Peruuta säännöllinen lahjoitus";
"DONATION_MONTHLY" = "Kuukausittain";
"DONATION_MONTHLY_FORMAT" = "%@/kuukausi";
"DONATION_MONTHLY_VIDEOLAN" = "Kuukausilahjoitus VideoLAN:lle";
"DONATION_ONCE" = "Kertaluonteinen";
"DONATION_UPDATE_MONTHLY" = "Päivitä säännöllistä lahjoitusta";
"DONATION_VIDEOLAN" = "Lahjoitus VideoLAN:lle";
"DONATION_CANCEL_LONG" = "Olemme surullisia, että peruutat säännöllisen kuukausilahjoituksen VideoLAN:lle. Aiempi tukesi merkitsee meille paljon. Kiitos tuestasi!";
"DONATION_BANK_TRANSFER" = "Pankkisiirto";
"DONATION_BANK_TRANSFER_LONG" = "Stripe käsittelee VideoLAN:lle tehtyjä lahjoituksia. VideoLAN ei tallenna tai kerää henkilötietojasi.";
"DONATION_BUTTON_AGREE" = "Hyväksyn";
"DONATION_IBAN" = "Tilinumero (IBAN)";
"DONATION_EMAIL" = "Sähköposti";
"DONATION_NAME" = "Nimi";
"DONATION_NAME_BANK_ACCOUNT" = "Nimi pankkitilillä";
"DONATION_EMBARGOED_COUNTRY" = "Emme voi tällä hetkellä ottaa vastaan lahjoituksia maassasi. Nauti VLC:stä!";

// MARK: - Playback keyboard shortcuts

"KEY_JUMP_BACKWARDS" = "Hyppää taaksepäin";
"KEY_JUMP_FORWARDS" = "Hyppää eteenpäin";
"KEY_INCREASE_PLAYBACK_SPEED" = "Lisää toistonopeutta";
"KEY_DECREASE_PLAYBACK_SPEED" = "Vähennä toistonopeutta";
"KEY_RESET_PLAYBACK_SPEED" = "Palauta toistonopeus";
"KEY_SEEK_TO_PERCENT" = "Kelaa %i%% kestosta";

// MARK: - TitleSelection

"TITLESELECTION_BACKGROUND_LABEL" = "Otsikon valinnan tausta";
"TITLESELECTION_BACKGROUND_HINT" = "Poista näkymä napauttamalla.";

// MARK: - NEW DELETE STRINGS
"DELETE_SINGLE_TITLE" = "Poistetaanko \"%@\"?";
"DELETE_MULTIPLE_TITLE" = "Poistetaanko \"%@\" ja %d lisäksi?";

// MARK: - AppIntent Strings
"APPINTENT_PLAY_MEDIA_TITLE" = "Toista taustalla";
"APPINTENT_PLAY_MEDIA_DESCRIPTION" = "Toista valittua soittolistaa taustalla avaamatta sovellusta.";
"APPINTENT_PLAY_MEDIA_PLAY_${mediaName}" = "Toista ${mediaName} taustalla";

// MARK: - VerticalSliderControl Strings
"VERTICAL_SLIDER_CONTROL_ACCESSIBILITY_LABEL" = "Pystyliukusäädin";
"VERTICAL_SLIDER_CONTROL_INCREMENT_ACTION" = "Kasvu";
"VERTICAL_SLIDER_CONTROL_DECREMENT_ACTION" = "Vähennys";

// MARK: - Download Completion Announcement
"DOWNLOAD_COMPLETED_ANNOUNCEMENT" = "Tiedosto \"%@\" ladattu";

//MARK: - Playlist Add Action Status
"ADD_TO_PLAYLIST_STATUS_MESSAGE" = "Lisätty %d - %@";
"ADD_ALERT_TITLE" = "Valinta löytyi soittolistasta";
"ADD_ALERT_MESSAGE_SINGLE" = "Yrität lisätä mediaa, joka on jo %@";
"ADD_ALERT_MESSAGE_MULTIPLE" = "Yrität lisätä %d , jotka ovat jo %@";

//MARK: - Last played playlist indicator
"LAST_PLAYED_PLAYLIST_LABEL_TITLE" = "Viimeksi toistettu";
